Revit 2024 API
FabricationConfiguration.GetSpecificationByGUID Method
 Gets the specification identifier by its GUID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int GetSpecificationByGUID(
	Guid specificationGUID
)
Visual Basic
Public Function GetSpecificationByGUID ( _
	specificationGUID As Guid _
) As Integer
Visual C++
public:
int GetSpecificationByGUID(
	Guid specificationGUID
)
Parameters
specificationGUID
Type: System.Guid
 The specification GUID.
Return Value
 The specification identifier. Returns 0 if not found.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace